#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_directory_service_directory.service_directory will be created
  + resource "aws_directory_service_directory" "service_directory" {
      + access_url        = (known after apply)
      + alias             = (known after apply)
      + dns_ip_addresses  = (known after apply)
      + edition           = "Standard"
      + enable_sso        = false
      + id                = (known after apply)
      + name              = "cq.cloudquery.local"
      + password          = (sensitive value)
      + security_group_id = (known after apply)
      + short_name        = (known after apply)
      + size              = (known after apply)
      + tags_all          = (known after apply)
      + type              = "MicrosoftAD"

      + vpc_settings {
          + availability_zones = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.demo.aws_iam_role.workspaces_default_role will be created
  + resource "aws_iam_role" "workspaces_default_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "workspaces.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "workspaces_DefaultRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.demo.aws_iam_role_policy_attachment.workspaces_default_self_service_access will be created
  + resource "aws_iam_role_policy_attachment" "workspaces_default_self_service_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonWorkSpacesSelfServiceAccess"
      + role       = "workspaces_DefaultRole"
    }

  # module.demo.aws_iam_role_policy_attachment.workspaces_default_service_access will be created
  + resource "aws_iam_role_policy_attachment" "workspaces_default_service_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonWorkSpacesServiceAccess"
      + role       = "workspaces_DefaultRole"
    }

  # module.demo.aws_vpc_dhcp_options.dns_resolver will be created
  + resource "aws_vpc_dhcp_options" "dns_resolver" {
      + arn                 = (known after apply)
      + domain_name         = "cq.cloudquery.local"
      + domain_name_servers = (known after apply)
      + id                  = (known after apply)
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "cq-dev-dhcp-option"
        }
      + tags_all            = {
          + "Name" = "cq-dev-dhcp-option"
        }
    }

  # module.demo.aws_vpc_dhcp_options_association.dns_resolver will be created
  + resource "aws_vpc_dhcp_options_association" "dns_resolver" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.demo.aws_workspaces_directory.directory will be created
  + resource "aws_workspaces_directory" "directory" {
      + alias                       = (known after apply)
      + customer_user_name          = (known after apply)
      + directory_id                = (known after apply)
      + directory_name              = (known after apply)
      + directory_type              = (known after apply)
      + dns_ip_addresses            = (known after apply)
      + iam_role_id                 = (known after apply)
      + id                          = (known after apply)
      + ip_group_ids                = (known after apply)
      + registration_code           = (known after apply)
      + subnet_ids                  = (known after apply)
      + tags_all                    = (known after apply)
      + workspace_security_group_id = (known after apply)

      + self_service_permissions {
          + change_compute_type  = true
          + increase_volume_size = true
          + rebuild_workspace    = true
          + restart_workspace    = true
          + switch_running_mode  = true
        }

      + workspace_access_properties {
          + device_type_android    = "ALLOW"
          + device_type_chromeos   = "ALLOW"
          + device_type_ios        = "ALLOW"
          + device_type_linux      = "DENY"
          + device_type_osx        = "ALLOW"
          + device_type_web        = "DENY"
          + device_type_windows    = "ALLOW"
          + device_type_zeroclient = "DENY"
        }

      + workspace_creation_properties {
          + enable_internet_access              = true
          + enable_maintenance_mode             = true
          + user_enabled_as_local_administrator = true
        }
    }

  # module.demo.aws_workspaces_workspace.workspace will be created
  + resource "aws_workspaces_workspace" "workspace" {
      + bundle_id                      = "wsb-gk1wpk43z"
      + computer_name                  = (known after apply)
      + directory_id                   = (known after apply)
      + id                             = (known after apply)
      + ip_address                     = (known after apply)
      + root_volume_encryption_enabled = false
      + state                          = (known after apply)
      + tags                           = {
          + "Department" = "IT"
        }
      + tags_all                       = {
          + "Department" = "IT"
        }
      + user_name                      = "Admin"
      + user_volume_encryption_enabled = false

      + timeouts {
          + create = "60m"
          + delete = "30m"
          + update = "60m"
        }

      + workspace_properties {
          + compute_type_name                         = "VALUE"
          + root_volume_size_gib                      = 80
          + running_mode                              = "AUTO_STOP"
          + running_mode_auto_stop_timeout_in_minutes = 60
          + user_volume_size_gib                      = 10
        }
    }

  # module.demo.random_password.this will be created
  + resource "random_password" "this" {
      + id          = (known after apply)
      + length      = 40
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.demo.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "cq-workspace-vpc-us-east-1a"
        }
      + tags_all             = {
          + "Name" = "cq-workspace-vpc-us-east-1a"
        }
      + vpc                  = true
    }

  # module.demo.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "cq-workspace-vpc"
        }
      + tags_all = {
          + "Name" = "cq-workspace-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.demo.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "cq-workspace-vpc-us-east-1a"
        }
      + tags_all             = {
          + "Name" = "cq-workspace-vpc-us-east-1a"
        }
    }

  # module.demo.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.demo.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.demo.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cq-workspace-vpc-private"
        }
      + tags_all         = {
          + "Name" = "cq-workspace-vpc-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "cq-workspace-vpc-public"
        }
      + tags_all         = {
          + "Name" = "cq-workspace-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.101.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "cq-workspace-vpc-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Name" = "cq-workspace-vpc-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.demo.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.101.0.0/18"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "cq-workspace-vpc"
        }
      + tags_all                             = {
          + "Name" = "cq-workspace-vpc"
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @zagronitay, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*